In [5]:
import pandas as pd

In [6]:
df=pd.read_csv('../data/2016/ColonieMile/ColonieMile2.csv')
print df.shape
df.head()

(59, 8)

   Place FIRST_NAME  LAST_NAME  Ag Sex              City      Time member
0      1       Eric      Young  24   M            Latham  04:41.70    yes
1      2      Brian      Woods  31   M  Saratoga Springs  04:44.40     no
2      3       Josh     Merlis  34   M            Albany  04:47.80    yes
3      4    Michael  Nickerson  27   M      Clifton Park  04:56.24    yes
4      5       Nick    Webster  27   M            Albany  05:00.90    yes

In [7]:
hmrrc=df[df['member']=='yes']
print hmrrc.shape

(47, 8)

In [8]:
hmrrc=hmrrc[['Place','FIRST_NAME','LAST_NAME','Sex','Ag']]
hmrrc.head()

   Place FIRST_NAME  LAST_NAME Sex  Ag
0      1       Eric      Young   M  24
2      3       Josh     Merlis   M  34
3      4    Michael  Nickerson   M  27
4      5       Nick    Webster   M  27
6      7        Ben     Heller   M  27

In [9]:
hmrrc=hmrrc.sort_values(['Sex','Ag','Place'])

In [10]:
hmrrc.head()

    Place FIRST_NAME  LAST_NAME Sex  Ag
36     37      Julia     Barker   F  13
34     35    Jourdyn  Nicholson   F  15
29     30   Michelle      Davis   F  27
47     48      Clare     Browne   F  27
17     18     Nicole   Soblosky   F  29

In [11]:
def AgeToCat(age):
    if (0<age<30):
        return "a_open"
    if (30<=age<40):
        return "b_30_39"
    if (40<=age<50):
        return "c_40_49"
    if (50<=age<60):
        return "d_50_59"
    if (60<=age<70):
        return "e_60_69"
    if (age>=70):
        return "f_70+"

In [12]:
hmrrc["age_cat"]=hmrrc.Ag.apply(lambda x:AgeToCat(x))
hmrrc.head()

    Place FIRST_NAME  LAST_NAME Sex  Ag age_cat
36     37      Julia     Barker   F  13  a_open
34     35    Jourdyn  Nicholson   F  15  a_open
29     30   Michelle      Davis   F  27  a_open
47     48      Clare     Browne   F  27  a_open
17     18     Nicole   Soblosky   F  29  a_open

In [13]:
hmrrc=hmrrc.sort_values(['Sex','age_cat','Place'])
hmrrc.head()

    Place FIRST_NAME  LAST_NAME Sex  Ag age_cat
17     18     Nicole   Soblosky   F  29  a_open
29     30   Michelle      Davis   F  27  a_open
34     35    Jourdyn  Nicholson   F  15  a_open
36     37      Julia     Barker   F  13  a_open
47     48      Clare     Browne   F  27  a_open

In [14]:
hmrrc['name']=hmrrc.FIRST_NAME+" "+hmrrc.LAST_NAME
hmrrc.head()

    Place FIRST_NAME  LAST_NAME Sex  Ag age_cat               name
17     18     Nicole   Soblosky   F  29  a_open    Nicole Soblosky
29     30   Michelle      Davis   F  27  a_open     Michelle Davis
34     35    Jourdyn  Nicholson   F  15  a_open  Jourdyn Nicholson
36     37      Julia     Barker   F  13  a_open       Julia Barker
47     48      Clare     Browne   F  27  a_open       Clare Browne

In [16]:
hmrrc.to_csv('../data/2016/ColonieMile/ColonieMile_scored.csv')